defmodule YubinBango.CsvUtils do
  @moduledoc """
  A module for CSV utilities

  郵便番号データファイルの形式等

  全角となっている町域部分の文字数が38文字を越える場合、また半角となっているフリガナ部分の文字数が76文字を越える場合は、複数レコードに分割しています。
  この郵便番号データファイルでは、以下の順に配列しています。

  1. 全国地方公共団体コード（JIS X0401、X0402）………　半角数字
  2.（旧）郵便番号（5桁）………………………………………　半角数字
  3. 郵便番号（7桁）………………………………………　半角数字
  4. 都道府県名　…………　半角カタカナ（コード順に掲載）　（※1）
  5. 市区町村名　…………　半角カタカナ（コード順に掲載）　（※1）
  6. 町域名　………………　半角カタカナ（五十音順に掲載）　（※1）
  7. 都道府県名　…………　漢字（コード順に掲載）　（※1,2）
  8. 市区町村名　…………　漢字（コード順に掲載）　（※1,2）
  9. 町域名　………………　漢字（五十音順に掲載）　（※1,2）
  10. 一町域が二以上の郵便番号で表される場合の表示　（※3）　（「1」は該当、「0」は該当せず）
  11. 小字毎に番地が起番されている町域の表示　（※4）　（「1」は該当、「0」は該当せず）
  12. 丁目を有する町域の場合の表示　（「1」は該当、「0」は該当せず）
  13. 一つの郵便番号で二以上の町域を表す場合の表示　（※5）　（「1」は該当、「0」は該当せず）
  14. 更新の表示（※6）（「0」は変更なし、「1」は変更あり、「2」廃止（廃止データのみ使用））
  15. 変更理由　（「0」は変更なし、「1」市政・区政・町政・分区・政令指定都市施行、「2」住居表示の実施、「3」区画整理、「4」郵便区調整等、「5」訂正、「6」廃止（廃止データのみ使用））
  ※1

  文字コードには、MS漢字コード（SHIFT JIS）を使用しています。
  ※2

  文字セットとして、JIS X0208-1983を使用し、規定されていない文字はひらがなで表記しています。
  ※3

  「一町域が二以上の郵便番号で表される場合の表示」とは、町域のみでは郵便番号が特定できず、丁目、番地、小字などにより番号が異なる町域のことです。
  ※4

  「小字毎に番地が起番されている町域の表示」とは、郵便番号を設定した町域（大字）が複数の小字を有しており、各小字毎に番地が起番されているため、町域（郵便番号）と番地だけでは住所が特定できない町域のことです。
  """

  @headers [
    :org_code,
    :former_zipcode,
    :zipcode,
    :prefecture_kana,
    :city_kana,
    :district_kana,
    :prefecture,
    :city,
    :district,
    :is_double_zip,
    :is_subdivision,
    :is_townships,
    :is_doubled_area,
    :is_updated,
    :change_reason
  ]

  @spec decode_japan_post_csv(Enumerable.t()) :: Enumerable.t()
  def decode_japan_post_csv(stream) do
    stream
    |> CSV.decode!(headers: @headers)
  end
end
